EventSimulator/EventData/IFax.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><Event generic="1.0.0.23" product-family="85" product-version="0100R100" operation-version="01.00.00" xmlns="urn:schemas-sc-jp:mfp:osa-1-1"><event-data><user-info><account-id>1</account-id></user-info><device-info uuid="SN1722924121MNSHARP MX-5111N" machineid="" osaversion="4.1"><serial-number>1722924121</serial-number><modelname>SHARP MX-5111N</modelname><location>Simulation</location><mac_address>00:00:00:00:00:00</mac_address><network_address>172.29.241.218</network_address><name>WS-VGA MX 41-V Series</name></device-info><details xsi:type="DETAILS_ON_JOB_COMPLETED_TYPE"><JobResults xsi:type="JOB_RESULTS_SCAN_TYPE"><mfp-job-id><JobId uid="SN1722924121JB2535759737"><job-type>SCAN</job-type><UISessionId>SN1722924121UI2433417297</UISessionId></JobId></mfp-job-id><job-mode sys-name="JOB_MODE_INTERNET_FAX_SEND" /><job-status><status>FINISHED</status><details xsi:type="JOB_STATUS_DETAILS_FINISHED_TYPE"><started_at>2012-02-28T10:54:13.6228481+05:30</started_at><stopped_at>2012-02-28T10:54:17.6540465+05:30</stopped_at></details></job-status><timestamp mark="JOB_START">2012-02-28T10:54:13.6228481+05:30</timestamp><timestamp mark="JOB_END">2012-02-28T10:54:17.6540465+05:30</timestamp><user-info><account-id>1</account-id></user-info><device-info uuid="SN1722924121MNSHARP MX-5111N" machineid="" osaversion="4.1"><serial-number>1722924121</serial-number><modelname>SHARP MX-5111N</modelname><location>Simulation</location><mac_address>00:00:00:00:00:00</mac_address><network_address>172.29.241.218</network_address><name>WS-VGA MX 41-V Series</name></device-info><properties><property sys-name="duplex-mode">SS</property><property sys-name="duplex-dir">BOOK</property><property sys-name="exposure-level">0</property><property sys-name="rotation">ROT_OFF</property></properties><resources><paper-out><sheet-count>1</sheet-count><property sys-name="color-mode">MONOCHROME</property></paper-out><paper-out><copies-count at="completed">1</copies-count><copies-count at="reserved">1</copies-count><page-count at="completed">1</page-count><page-count at="reserved">1</page-count></paper-out><paper-out><sheet-count>1</sheet-count><property sys-name="color-mode">MONOCHROME</property><property sys-name="papersize">A4</property></paper-out></resources></JobResults></details></event-data></Event></soap:Body></soap:Envelope>